* <2018-07-03 Tue>
  % BEGIN RECEIVE ORGTBL salesfigures
  % END RECEIVE ORGTBL salesfigures
  \begin{comment}
  #+ORGTBL: SEND salesfigures orgtbl-to-latex
  | Month | Days | Nr sold | per day |
  |-------+------+---------+---------|
  | Jan   |   23 |      55 |     2.4 |
  | Feb   |   21 |      16 |     0.8 |
  | March |   22 |     278 |    12.6 |
  #+TBLFM: $4=$3/$2;%.1f
  % $ (optional extra dollar to keep font-lock happy, see footnote)
  \end{comment}

  #+BEGIN_SRC emacs-lisp
       (defun org-xor (a b)
          "Exclusive or."
          (if a (not b) b))
  #+END_SRC

  #+RESULTS:
  : org-xor

  #+BEGIN_SRC plateuml 
  @startuml;
     Bob -[#red]> Alice : hello
     Alice -[#0000FF]->Bob : ok
  @enduml
  #+END_SRC

  #+BEGIN_SRC c++
  #include <iostream>
  using namespace std;
  int main(){
  cout << "" << endl;
  return 0;
  }
  #+END_SRC

  #+BEGIN_SRC c
  #include <stdio.h>

  int main(){
  printf("hello!");
  return 0;
  }
  #+END_SRC

  #+BEGIN_SRC plantuml :file ./test/orgmode-babel-sequenceuml.png
    Alice -> Bob: synchronous call
    Alice ->> Bob: asynchronous call
  #+END_SRC

  #+BEGIN_SRC dot :file ./test-dot.png :var input=make-dot :exports results
  graph {
  $input
  }
  #+END_SRC
